/* Note:Your choice is C IDE */
#include "stdio.h"

// 定义了一个结构, 名为 Date
struct Date
{
	int year;
	int month;
	int day;
};

// 传入一个参数 (int)年份, 返回一个当年是否为闰年, 是(1), 否(0)
int Is_Leap_Year( int year )
{
    if( year % 400 == 0 || ( (year % 4 == 0) && (year % 100 != 0) ) )
        return 1;
    else return 0;
}

// 依次传入( 被检测的数的值, 期望的最小值min, 期望的最大值max ), 此函数检测数值是否落在 [min, max]闭区间 之中的函数, 返回: 是(1), 否(0)
int checkNum( int num, int min, int max )
{
    if( num >= min && num <= max )
        return 1;
    else
        return 0;
}

// 依次传入( 年份year, 月份month ), 此函数返回 year 年的 month 月有多少天
int dayInMonth(int year, int month)
{
    int daysInMonth[13] = {0, 31, 28, 31, 30, 31, 30, 31, 31, 30, 31, 30, 31};
    if( year % 400 == 0 || ( (year % 4 == 0) && (year % 100 != 0) ) )
        daysInMonth[2]++;
    return daysInMonth[month];
}

// 传入要写入数据的 struct Date变量 的地址, 此函数应保证在调用本函数后, 写入的数值都是正确的
int getTheDate(struct Date *p)
{
    while(1)
    {
        printf( "\n请输入日期( 格式: year-month-day ):\n");
        scanf( "%d-%d-%d", &(p->year), &(p->month), &(p->day) );

        // 层层递进的判断, 想判断日, 就要保证月是对的, 想判断月, 要保证年是对的
        if( checkNum( p->year, 1, 2200 ) )
            if( checkNum( p->month, 1, 12 ) )
                if( checkNum( p->day, 1, dayInMonth( p->year, p->month ) ) )
                    break;

        printf( "\n输入有误, 请检查并重新输入.\n");
    }   
}
   



int main()
{
    struct Date D1,D2;                      // 复刻出来两个 结构变量,  其类型为 struct Date.

    int a1[12]={31,28,31,30,31,30,31,31,30,31,30,31};               // 平年的每个月都有几天
    int a2[12]={31,29,31,30,31,30,31,31,30,31,30,31};               // 闰年的每个月都有几天

/*===================================================================
    变量定义
        定义了两组int的变量, 
        x 和 a 分别用来统计 第一个输入日期的 年份的天数 和 每月的天数
===================================================================*/
    int day=0, day1=0, day2=0, x=0, y=0, a=0, b=0, i;


//========测试用的代码====
    // D1 = (struct Date ) { 1949, 10, 1 };
    // D2 = (struct Date ) { 2023, 10, 1 };



//=====新的输入模块, 能够检测出用户输入是否正确
    printf("--------------------------------------------\n请输入第一日期:\n");
    getTheDate(&D1);                            // 第一日期输入    
    printf("--------------------------------------------\n请输入第二日期:\n");
    getTheDate(&D2);

    printf("--------------------\n");
    printf("第一日期: %d-%d-%d\n", D1.year, D1.month, D1.day);
    printf("第二日期: %d-%d-%d\n", D2.year, D2.month, D2.day);
    printf("--------------------\n");


//================================================================================================
//================================================================================================
//
//                           计  算  D 1  的  日  期
//                      x : 公元元年一月一日到该年一月一日的天数
//                      a : 该年一月一日到该月一日的天数
//
//================================================================================================
//================================================================================================

    // 计算从 公元元年 到第一个日期(D1.year), 只算年的话有多少天, 
    // _________________  累加到变量 x 中!  _________________

    for( i=1; i < D1.year; i++ )
    {
        // 闰年的情况:
        if( Is_Leap_Year( i ) )
        {
            x += 366;           // 闰年 366 天
        }
        else 
        {
            x += 365;           // else, 就是平年, 就是 365 天
        }
    }


    // 计算从 第一日期的年份(D1.year) 的 1月1日, 到第一日期的 某月1日(D1.month) 有多少天, 
    // _______________________________  累加到变量 a 中!  _______________________________

    for( i = 0; i < D1.month - 1; i++ )
    {
        // 如果是闰年:
        if( Is_Leap_Year( D1.year ) )
        {
            a += a1[i];             // 累加每月的天数( 闰年的 )
        }

        else
        {
            a += a2[i];             // 累加每月的天数( 平年的 )
        }
    }





//================================================================================================
//================================================================================================
//
//                      然 后 再 计 算 D 2 的 日 期
//                      可复制上方的代码, 然后把D1, 改成D2,
//                      然后把 x 改为 y, a 改为 b.
//
//================================================================================================
//================================================================================================




    // 计算从 公元元年 到第二个日期(D2.year), 只算年的话有多少天, 
    // _________________  累加到变量 y 中!  _________________
    for( i=1; i < D2.year; i++ )
    {
        // 闰年的情况
        if( Is_Leap_Year( i ) )
        {   
            y += 366;           // 闰年 366 天
        }
        else
        {
            y += 365;           // else, 就是平年, 就是 365 天    
        }
    }


    // 计算从 第二日期的年份(D2.year) 的 1月1日, 到第二日期的 某月1日(D2.month) 有多少天, 
    // _______________________________  累加到变量 b 中!  _______________________________

    for( i=0; i < D2.month - 1; i++ ) 
    {

        if( Is_Leap_Year( D2.year ) )
        {
            b += a2[i];             // 累加每月的天数( 闰年的 )
        }
        else
        {
            b += a2[i];             // 累加每月的天数( 平年的 )
        }
    }






//================================================================================================
//================================================================================================
//
//                        最     后     的     计     算
//
//================================================================================================
//================================================================================================

//  1年1月1日到当天的天数 
//    = 公元元年一月一日到该年一月一日的天数( x或者y ) 
//      + 该年一月一日到该月一日的天数( a或者b ) 
//      + 该月的第几天 
    day1 = x + a + D1.day;
    day2 = y + b + D2.day;


// 两者相减, 即得天数(day).
    day=day1-day2;


// 如果用户输入反了, 结果就是负的, 变成正的就行
    if(day<0)
    {
        day=-day;
    }


// 输出
    printf("相差%d天\n\n",day);
    system( "pause" );

}