#include "stdio.h"

int DrawMenu()
{
	printf("\n\n\n\n\n");
	printf("\t----------------------------------------------------\n");
	printf("\t|             学 生 管 理 系 统 ver.100            |\n");
	printf("\t----------------------------------------------------\n");
	printf("\t|                                                  |\n");
	printf("\t|       ---  批量编辑器(核心功能)  ---             |\n");
	printf("\t|      包含:                                       |\n");
	printf("\t|      计算平均成绩, 排序, 保存到文件, 从文件读取  |\n");
	printf("\t|      本程序采用命令形式实现以上功能,             |\n");
	printf("\t|      详细使用方法请看压缩包内文档.               |\n");
	printf("\t|                                                  |\n");
	printf("\t|      特点:                                       |\n");
	printf("\t|        1. 运用数据结构知识, 使用链表实现,        |\n");
	printf("\t|        相比数组, 更加灵活, 强大, 不受数组大小限制|\n");
	printf("\t|    ( 貌似可存几万组数据还不崩溃, 暂无暴力测试 )  |\n");
	printf("\t|                                                  |\n");
	printf("\t|        2. 通宵写了10个小时                       |\n");
	printf("\t|        3. 明明不会链表的任何排序硬是做出来了     |\n");
	printf("\t|        4. 可随时保存数据, 很实用奥               |\n");
	printf("\t----------------------------------------------------\n");
	// printf("\n\t>>> 请输入选择的功能(1~5): ");
}