#include <stdio.h>
#include <stdlib.h>

int main()
{
    int i, j, k;
    char a[100][2] = {};
    float list[100][2] = {};      // 存储价格 以及折扣

    // 除去开头的九个空格
    passChar(9);
    
    for(i=0; i<2; i++)
    {
        getPrice( &list[i][0] );
        
        passChar(7);

        getTheOff( &list[i][1]);

        // while(getchar() != '/n');
    }
    printf("%.2f   %.2f折", list[0][0], list[i][1]);b
    printf("%.2f   %.2f折", list[1][0], list[i][1]);


  
    return 0;
}

// 获取价格方法
// 指针 p 应指向 main() 中的 list[i][0]
void getPrice(float *p)
{
    char i = getchar();
    if(i != ' ')                        
        *p += (i-48)*100;               //对百位进行读取, 若为空格, 则加0.

    *p += (i=getchar()-48)*10;          // 对十位进行读取.
    *p += (i=getchar()-48);             // 对个位进行读取.
    getchar();                          // 跳过了小数点.
    *p += (getchar()-48) * 0.1;         // 十分位.
    *p += (getchar()-48) * 0.01;        // 百分位
}

// 获取折扣
// 指针 p 应指向 main() 中的 list[i][1]
void getTheOff(float *p)
{
    char i = getchar();
    // 如果第一位是空格, 跳过这一位, 后面的数字直接就是折扣
    if( i == ' ' )
    {
        i = getchar();                  // 跳过这一位.
        *p += (i-48)*0.1;
    }

    else
    {
        *p += (i-48)*0.1;               // 十分位折扣
        i = getchar();
        *p += (i-48)*0.01;              // 百分位折扣
    }
}

// 跳过n个字符的函数, 输入int
void passChar(int n)
{
    int i = 0;
    for(i = 0; i<n; i++)
        getchar();
}


/*
        输入样例

****     180.90       88折
****      10.25       65折
****      56.14        9折
****     104.65        9折
****     100.30       88折
****     297.15        半价
****      26.75       65折
****     130.62        半价
****     240.28       58折
****     270.62        8折
****     115.87       88折
****     247.34       95折
****      73.21        9折
****     101.00        半价
****      79.54        半价
****     278.44        7折
****     199.26        半价
****      12.97        9折
****     166.30       78折
****     125.50       58折
****      84.98        9折
****     113.35       68折
****     166.57        半价
****      42.56        9折
****      81.90       95折
****     131.78        8折
****     255.89       78折
****     109.17        9折
****     146.69       68折
****     139.33       65折
****     141.16       78折
****     154.74        8折
****      59.42        8折
****      85.44       68折
****     293.70       88折
****     261.79       65折
****      11.30       88折
****     268.27       58折
****     128.29       88折
****     251.03        8折
****     208.39       75折
****     128.88       75折
****      62.06        9折
****     225.87       75折
****      12.89       75折
****      34.28       75折
****      62.16       58折
****     129.12        半价
****     218.37        半价
****     289.69        8折



*/